SunCity/src/Catalogs/ВидыОплатЧекаККМ/ВидыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОплатЧекаККМ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БанковскийПлатеж</name>
      <description>Банковский платеж</description>
    </items>
    <items>
      <name>ВстречноеПредоставление</name>
      <description>Встречное предоставление</description>
    </items>
    <items>
      <name>ЗачетАванса</name>
      <description>Зачет аванса</description>
    </items>
    <items>
      <name>МобильныйПлатеж</name>
      <description>Мобильный платеж</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаБонусамиКакСкидкой</name>
      <description>Оплата бонусами (распределяется как скидка)</description>
    </items>
    <items>
      <name>ОплатаВрассрочку</name>
      <description>Оплата в рассрочку</description>
    </items>
    <items>
      <name>ОплатаПодарочнымСертификатом</name>
      <description>Оплата подарочным сертификатом</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплатЧекаККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкКредитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентБанковскойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежнаяСистема</name>
    <type>
      <types>EnumRef.ТипыПлатежнойСистемыККТ</types>
    </type>
  </attributes>
</mdclass:Catalog>

SunCity/src/Enums/ТипыОплатЧекаККМ/ТипыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплатЧекаККМ</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийКредит</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>Бонусы</name>
  </enumValues>
  <enumValues>
    <name>ЗачетАванса</name>
  </enumValues>
  <enumValues>
    <name>ВРассрочку</name>
  </enumValues>
  <enumValues>
    <name>МобильныйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяСистема</name>
  </enumValues>
  <enumValues>
    <name>БанковскийПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ВстречноеПредоставление</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Catalogs/ВидыОплатЧекаККМ/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеЭлементамиФормыНаСервере();
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ИспользоватьОплатуБанковскимиКредитами = ПолучитьФункциональнуюОпцию("ИспользоватьОплатуБанковскимиКредитами");
	
	Если НЕ ИспользоватьОплатуБанковскимиКредитами Тогда
	
		УдаляемыйЭлемент = Элементы.ТипОплаты.СписокВыбора.НайтиПоЗначению(Перечисления.ТипыОплатЧекаККМ.БанковскийКредит);
		
		Если НЕ УдаляемыйЭлемент = Неопределено Тогда
			Элементы.ТипОплаты.СписокВыбора.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
	ИспользоватьОплатуПлатежнымиКартами = ПолучитьФункциональнуюОпцию("ИспользоватьОплатуПлатежнымиКартами");
	
	Если НЕ ИспользоватьОплатуПлатежнымиКартами Тогда
		
		Если НЕ Объект.Предопределенный Тогда
			УдалитьЭлементСпискаТипОплаты(Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Объект.Предопределенный Тогда
		
		УдалитьЭлементСпискаТипОплаты(Перечисления.ТипыОплатЧекаККМ.Наличные);
		УдалитьЭлементСпискаТипОплаты(Перечисления.ТипыОплатЧекаККМ.ПодарочныйСертификат);
		УдалитьЭлементСпискаТипОплаты(Перечисления.ТипыОплатЧекаККМ.Бонусы);
		УдалитьЭлементСпискаТипОплаты(Перечисления.ТипыОплатЧекаККМ.ЗачетАванса);
		УдалитьЭлементСпискаТипОплаты(Перечисления.ТипыОплатЧекаККМ.ВРассрочку);
		УдалитьЭлементСпискаТипОплаты(Перечисления.ТипыОплатЧекаККМ.ПлатежнаяСистема); 
		УдалитьЭлементСпискаТипОплаты(Перечисления.ТипыОплатЧекаККМ.БанковскийПлатеж);
		УдалитьЭлементСпискаТипОплаты(Перечисления.ТипыОплатЧекаККМ.ВстречноеПредоставление);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормыНаКлиенте();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОплатыПриИзменении(Элемент)
	
	УправлениеЭлементамиФормыНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормыНаСервере()
	
	Элементы.ТипОплаты.ТолькоПросмотр = Объект.Предопределенный;
		
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормыНаКлиенте()
	
	Элементы.ГруппаБанковскийКредит.Видимость =
		Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.БанковскийКредит");
	Элементы.ГруппаПлатежнаяСистема.Видимость =
		Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.ПлатежнаяСистема")
		ИЛИ Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта");
		
	Если Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта") Тогда
		Элементы.ПлатежнаяСистема.Заголовок = НСтр("ru = 'Карта привязана к платежной системе'");
	Иначе
		Элементы.ПлатежнаяСистема.Заголовок = НСтр("ru = 'Платежная система'");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементСпискаТипОплаты(ТипОплаты)
	
	УдаляемыйЭлемент = Элементы.ТипОплаты.СписокВыбора.НайтиПоЗначению(ТипОплаты);
	
	Если НЕ УдаляемыйЭлемент = Неопределено Тогда
		Элементы.ТипОплаты.СписокВыбора.Удалить(УдаляемыйЭлемент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
